hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/example/usart/uart_halfduplex_polling_master/source/main.c
/**
 *******************************************************************************
 * @file  usart/uart_halfduplex_polling_master/source/main.c
 * @brief This example demonstrates UART half-duplex data receive and transfer
 *        by polling mode.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2019-04-28       Hongjh          First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ddl.h"

/**
 * @addtogroup HC32F120_DDL_Examples
 * @{
 */

/**
 * @addtogroup UART_Halfduplex_Polling_Master
 * @{
 */

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/
/**
 * @brief Key state definition
 */
typedef enum
{
    KeyIdle,
    KeyRelease,
} en_key_state_t;

/**
 * @brief Key instance structure definition
 */
typedef struct
{
    uint8_t u8Port;                     /*!< GPIO_PORT_x: x can be (0~7, 12~14) to select the GPIO peripheral */

    uint8_t u8Pin;                      /*!< GPIO_PIN_x: x can be (0~7) to select the PIN index */

    en_pin_state_t enPressPinState;     /*!< Pin level state when key is pressed */
} stc_key_t;

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/* Key Port/Pin definition */
#define KEY_PORT                        GPIO_PORT_7
#define KEY_PIN                         GPIO_PIN_0

/* Red LED Port/Pin definition */
#define LED_R_PORT                      GPIO_PORT_2
#define LED_R_PIN                       GPIO_PIN_5
#define LED_R_ON()                      GPIO_ResetPins(LED_R_PORT, LED_R_PIN)
#define LED_R_OFF()                     GPIO_SetPins(LED_R_PORT, LED_R_PIN)

/* Green LED Port/Pin definition */
#define LED_G_PORT                      GPIO_PORT_2
#define LED_G_PIN                       GPIO_PIN_6
#define LED_G_TOGGLE()                  GPIO_TogglePins(LED_G_PORT, LED_G_PIN)
#define LED_G_OFF()                     GPIO_SetPins(LED_G_PORT, LED_G_PIN)

/* UART TX Port/Pin definition */
#define UART_MASTER_TX_PORT             GPIO_PORT_0
#define UART_MASTER_TX_PIN              GPIO_PIN_0      /* P00: USART2_TX_B */

/* UART unit definition */
#define UART_MASTER_UNIT                M0P_USART2

/* UART unit interrupt definition */
#define UART_MASTER_UNIT_ERR_INT        INT_USART_2_EI
#define UART_MASTER_UNIT_ERR_IRQn       Int016_IRQn

#define UART_MASTER_UNIT_RX_INT         INT_USART_2_RI
#define UART_MASTER_UNIT_RX_IRQn        Int018_IRQn

#define UART_MASTER_UNIT_TX_INT         INT_USART_2_TI
#define UART_MASTER_UNIT_TX_IRQn        Int020_IRQn

#define UART_MASTER_UNIT_TCI_INT        INT_USART_2_TCI
#define UART_MASTER_UNIT_TCI_IRQn       Int022_IRQn

/* Function clock gate definition  */
#define FUNCTION_CLK_GATE               CLK_FCG_UART2

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
static void SystemClockConfig(void);
static void LedConfig(void);
static en_key_state_t KeyGetState(stc_key_t *pstcKey);
static void UartRxErrProcess(void);

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/
static stc_key_t m_stcKeySw2 = {
    .u8Port = KEY_PORT,
    .u8Pin = KEY_PIN,
    .enPressPinState = Pin_Reset,
};

static const stc_uart_init_t m_stcUartInit = {
    .u32Baudrate = 19200,
    .u32BitDirection = USART_LSB,
    .u32StopBit = USART_STOP_BITS_1,
    .u32Parity = USART_PARITY_NONE,
    .u32DataWidth = USART_DATA_WIDTH_BITS_8,
    .u32ClkMode = USART_INTCLK_NONE_OUTPUT,
    .u32OversamplingBits = USART_OVERSAMPLING_BITS_8,
    .u32NoiseFilterState = USART_NOISE_FILTER_DISABLE,
    .u32SbDetectPolarity = USART_SB_DETECT_FALLING,
};

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 * @brief  Configure system clock.
 * @param  None
 * @retval None
 */
static void SystemClockConfig(void)
{
    stc_clk_xtal_init_t stcXTALInit;

    /* Configure XTAL */
    stcXTALInit.u8XtalState = CLK_XTAL_ON;
    stcXTALInit.u8XtalMode = CLK_XTALMODE_OSC;
    stcXTALInit.u8XtalDrv = CLK_XTALDRV_HIGH;
    stcXTALInit.u8XtalSupDrv = CLK_XTAL_SUPDRV_OFF;
    stcXTALInit.u8XtalStb = CLK_XTALSTB_8;

    /* Initialize XTAL clock */
    CLK_XTALInit(&stcXTALInit);

    /* Switch system clock from HRC(default) to XTAL */
    CLK_SetSysclkSrc(CLK_SYSCLKSOURCE_XTAL);
}

/**
 * @brief  Configure RGB LED.
 * @param  None
 * @retval None
 */
static void LedConfig(void)
{
    stc_gpio_init_t stcGpioInit = {0};

    stcGpioInit.u16PinMode = PIN_MODE_OUT;
    stcGpioInit.u16PinState = PIN_STATE_SET;
    GPIO_Init(LED_G_PORT, (LED_G_PIN | LED_R_PIN), &stcGpioInit);
}

/**
 * @brief  Get key state.
 * @param  [in] pstcKey    Pointer to stc_key_t structure
 * @retval An en_result_t enumeration value:
 *           - KeyIdle: Key isn't pressed.
 *           - KeyRelease: Released after key is pressed.
 */
static en_key_state_t KeyGetState(stc_key_t *pstcKey)
{
    DDL_ASSERT(NULL != pstcKey);

    if (pstcKey->enPressPinState != GPIO_ReadInputPortPin(pstcKey->u8Port, pstcKey->u8Pin))
    {
        return KeyIdle;
    }

    DDL_Delay1ms(20);

    if (pstcKey->enPressPinState != GPIO_ReadInputPortPin(pstcKey->u8Port, pstcKey->u8Pin))
    {
        return KeyIdle;
    }

    while (pstcKey->enPressPinState == GPIO_ReadInputPortPin(pstcKey->u8Port, pstcKey->u8Pin));

    return KeyRelease;
}

/**
 * @brief  USART RX error process function.
 * @param  None
 * @retval None
 */
static void UartRxErrProcess(void)
{
    if (Set == USART_GetFlag(UART_MASTER_UNIT, (USART_FLAG_PE | USART_FLAG_FE | USART_FLAG_ORE)))
    {
        USART_ClearFlag(UART_MASTER_UNIT, (USART_CLEAR_FLAG_PE | USART_CLEAR_FLAG_FE | USART_CLEAR_FLAG_ORE));
    }
    else
    {
    }
}

/**
 * @brief  Main function of UART halfduplex polling master project
 * @param  None
 * @retval int32_t return value, if needed
 */
int32_t main(void)
{
    uint8_t u8MasterTxData = 0;
    uint8_t u8MasterRxData = 0;

    /* Configure system clock. */
    SystemClockConfig();

    /* Initialize UART for debug print function. */
    DDL_UartInit();

    /* Configure LED. */
    LedConfig();

    /* Configure USART TX pin. */
    GPIO_SetFunc(UART_MASTER_TX_PORT, UART_MASTER_TX_PIN, GPIO_FUNC_USART);

    /* Enable peripheral clock */
    CLK_FcgPeriphClockCmd(FUNCTION_CLK_GATE, Enable);

    /* Initialize UART function. */
    USART_HalfDuplexInit(UART_MASTER_UNIT, &m_stcUartInit);

    while (1)
    {
        /* Wait key release */
        while (KeyRelease !=  KeyGetState(&m_stcKeySw2));

        /* Enable TX function && Disable RX function */
        USART_FuncCmd(UART_MASTER_UNIT, USART_RX, Disable);
        USART_FuncCmd(UART_MASTER_UNIT, USART_TX, Enable);

        /* Master unit send data */
        USART_SendData(UART_MASTER_UNIT, u8MasterTxData);

        /* Wait Tx complete */
        while (Reset == USART_GetFlag(UART_MASTER_UNIT, USART_FLAG_TC))
        {
        }

        /* Enable RX function && Disable TX function*/
        USART_FuncCmd(UART_MASTER_UNIT, USART_RX, Enable);
        USART_FuncCmd(UART_MASTER_UNIT, USART_TX, Disable);

        /* Wait Rx data register no empty */
        while (Reset == USART_GetFlag(UART_MASTER_UNIT, USART_FLAG_RXNE))
        {
        }

        u8MasterRxData = USART_RecData(UART_MASTER_UNIT);

        if (u8MasterRxData == u8MasterTxData)
        {
            LED_G_TOGGLE();
            LED_R_OFF();
        }
        else
        {
            LED_G_OFF();
            LED_R_ON();
        }

        printf("Master send:%d; master receive:%d \r\n", u8MasterTxData, u8MasterRxData);

        u8MasterTxData++;

        /* USART error handle */
        UartRxErrProcess();
    }
}

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
